#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_cognitive_account.ca will be created
  + resource "azurerm_cognitive_account" "ca" {
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "OpenAI"
      + local_auth_enabled                 = true
      + location                           = "eastus2"
      + name                               = "ahock-cognitive-account"
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = true
      + resource_group_name                = "ahock-ai-showcase-rg"
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "S0"
      + tags                               = {
          + "created_by" = "Terraform"
          + "project"    = "AI Showcase"
        }
    }

  # azurerm_cognitive_deployment.gpt35 will be created
  + resource "azurerm_cognitive_deployment" "gpt35" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "gpt-35-turbo"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "gpt-35-turbo"
          + version = "0613"
        }

      + scale {
          + capacity = 1
          + type     = "Standard"
        }
    }

  # azurerm_cognitive_deployment.gpt4 will be created
  + resource "azurerm_cognitive_deployment" "gpt4" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "gpt-4o"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "gpt-4o"
          + version = "2024-05-13"
        }

      + scale {
          + capacity = 1
          + type     = "Standard"
        }
    }

  # azurerm_cognitive_deployment.text-large will be created
  + resource "azurerm_cognitive_deployment" "text-large" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "text-embedding-large"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "text-embedding-3-large"
          + version = "1"
        }

      + scale {
          + capacity = 1
          + type     = "Standard"
        }
    }

  # azurerm_cognitive_deployment.text-small will be created
  + resource "azurerm_cognitive_deployment" "text-small" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "text-embedding-small"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "text-embedding-3-small"
          + version = "1"
        }

      + scale {
          + capacity = 1
          + type     = "Standard"
        }
    }

  # azurerm_log_analytics_workspace.log_analytics_workspace will be created
  + resource "azurerm_log_analytics_workspace" "log_analytics_workspace" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus2"
      + name                            = "ahock-log-analytics-workspace"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "ahock-ai-showcase-rg"
      + retention_in_days               = (known after apply)
      + secondary_shared_key            = (sensitive value)
      + sku                             = (known after apply)
      + tags                            = {
          + "created_by" = "Terraform"
          + "project"    = "AI Showcase"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_monitor_diagnostic_setting.settings will be created
  + resource "azurerm_monitor_diagnostic_setting" "settings" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "DiagnosticsSettings"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "Audit"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "RequestResponse"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "Trace"
            # (1 unchanged attribute hidden)
        }

      + log (known after apply)

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # azurerm_resource_group.openai will be created
  + resource "azurerm_resource_group" "openai" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "ahock-ai-showcase-rg"
      + tags     = {
          + "created_by" = "Terraform"
          + "project"    = "AI Showcase"
        }
    }

  # azurerm_role_assignment.cognitive_services_user_assignment will be created
  + resource "azurerm_role_assignment" "cognitive_services_user_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Cognitive Services OpenAI User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_static_web_app.static-web-app will be created
  + resource "azurerm_static_web_app" "static-web-app" {
      + api_key                            = (sensitive value)
      + configuration_file_changes_enabled = true
      + default_host_name                  = (known after apply)
      + id                                 = (known after apply)
      + location                           = "eastus2"
      + name                               = "ahock-static-web-app"
      + preview_environments_enabled       = true
      + resource_group_name                = "ahock-ai-showcase-rg"
      + sku_size                           = "Standard"
      + sku_tier                           = "Standard"
      + tags                               = {
          + "created_by" = "Terraform"
          + "project"    = "AI Showcase"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @adamhockemeyer, Action: `pull_request`, Working Directory: `/home/runner/work/AI-Showcase/AI-Showcase`, Workflow: `Terraform Plan`*